; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite6 - satellite
	instrument13 - instrument
	satellite7 - satellite
	instrument14 - instrument
	satellite8 - satellite
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	thermograph1 - mode
	image0 - mode
	Star1 - direction
	Star4 - direction
	Star3 - direction
	GroundStation0 - direction
	Star2 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star3)
	(supports instrument1 thermograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 image0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star2)
	(supports instrument4 image0)
	(calibration_target instrument4 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
	(supports instrument5 thermograph1)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 image0)
	(calibration_target instrument6 Star1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument7 image0)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon8)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 Star4)
	(supports instrument9 image0)
	(supports instrument9 thermograph1)
	(calibration_target instrument9 Star1)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon8)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 Star3)
	(supports instrument11 image0)
	(supports instrument11 thermograph1)
	(calibration_target instrument11 Star4)
	(supports instrument12 thermograph1)
	(supports instrument12 image0)
	(calibration_target instrument12 GroundStation0)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star5)
	(supports instrument13 image0)
	(supports instrument13 thermograph1)
	(calibration_target instrument13 Star3)
	(on_board instrument13 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Phenomenon6)
	(supports instrument14 image0)
	(supports instrument14 thermograph1)
	(calibration_target instrument14 GroundStation0)
	(on_board instrument14 satellite7)
	(power_avail satellite7)
	(pointing satellite7 GroundStation0)
	(supports instrument15 image0)
	(supports instrument15 thermograph1)
	(calibration_target instrument15 Star2)
	(supports instrument16 image0)
	(calibration_target instrument16 GroundStation0)
	(supports instrument17 thermograph1)
	(calibration_target instrument17 Star2)
	(on_board instrument15 satellite8)
	(on_board instrument16 satellite8)
	(on_board instrument17 satellite8)
	(power_avail satellite8)
	(pointing satellite8 Star4)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite1 Phenomenon9)
	(pointing satellite3 GroundStation0)
	(pointing satellite4 Phenomenon6)
	(pointing satellite5 Planet10)
	(pointing satellite7 Star4)
	(have_image Star5 thermograph1)
	(have_image Phenomenon6 thermograph1)
	(have_image Phenomenon7 image0)
	(have_image Phenomenon8 thermograph1)
	(have_image Phenomenon9 image0)
	(have_image Planet10 thermograph1)
	(have_image Star11 image0)
))

)

; plan
1. (turn_to satellite7 star4 groundstation0)
   deleted: (pointing satellite7 groundstation0)
   added: (pointing satellite7 star4)
   goals met: 1 of 13
2. (turn_to satellite5 planet10 star5)
   deleted: (pointing satellite5 star5)
   added: (pointing satellite5 planet10)
   goals met: 2 of 13
3. (turn_to satellite4 phenomenon6 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 phenomenon6)
   goals met: 3 of 13
4. (turn_to satellite3 groundstation0 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 groundstation0)
   goals met: 4 of 13
5. (turn_to satellite1 groundstation0 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 groundstation0)
   goals met: 4 of 13
6. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 4 of 13
7. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 4 of 13
8. (turn_to satellite1 phenomenon8 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon8)
   goals met: 4 of 13
9. (take_image satellite1 phenomenon8 instrument2 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 5 of 13
10. (turn_to satellite1 phenomenon7 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon7)
   goals met: 5 of 13
11. (take_image satellite1 phenomenon7 instrument2 image0)
   added: (have_image phenomenon7 image0)
   goals met: 6 of 13
12. (turn_to satellite1 phenomenon6 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon6)
   goals met: 6 of 13
13. (turn_to satellite0 star2 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star2)
   goals met: 7 of 13
14. (take_image satellite1 phenomenon6 instrument2 thermograph1)
   added: (have_image phenomenon6 thermograph1)
   goals met: 8 of 13
15. (turn_to satellite1 planet10 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 planet10)
   goals met: 8 of 13
16. (take_image satellite1 planet10 instrument2 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 9 of 13
17. (turn_to satellite1 star11 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star11)
   goals met: 9 of 13
18. (take_image satellite1 star11 instrument2 image0)
   added: (have_image star11 image0)
   goals met: 10 of 13
19. (turn_to satellite1 star5 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star5)
   goals met: 10 of 13
20. (take_image satellite1 star5 instrument2 thermograph1)
   added: (have_image star5 thermograph1)
   goals met: 11 of 13
21. (turn_to satellite1 phenomenon9 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon9)
   goals met: 12 of 13
22. (take_image satellite1 phenomenon9 instrument2 image0)
   added: (have_image phenomenon9 image0)
   goals met: 13 of 13
